tap "homebrew/bundle"
tap "homebrew/services"
brew "bat"
brew "clang-format"
brew "node"
brew "corepack"
brew "deno"
brew "go"
brew "golangci-lint"
brew "hadolint"
brew "hugo"
brew "massren"
brew "p7zip"
brew "python@3.11"
brew "rbenv"
brew "ripgrep"
brew "rustup"
brew "tree"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "docker", args: { appdir: "/Applications" }
cask "dotnet-sdk"
cask "flutter"
cask "font-hackgen", args: { appdir: "/Applications" }
cask "google-chrome", args: { appdir: "/Applications" }
cask "iterm2", args: { appdir: "/Applications" }
cask "rar"
cask "steam", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "denoland.vscode-deno"
vscode "golang.go"
vscode "ionutvmi.path-autocomplete"
vscode "jebbs.plantuml"
vscode "mathiasfrohlich.kotlin"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.python"
vscode "ms-vscode.cpptools"
vscode "sgryjp.japanese-word-handler"
vscode "yeannylam.recenter-top-bottom"
vscode "yzhang.markdown-all-in-one"
